MaikieMaiky/Esp8266/2_3Pin_State_Display/src/main.cpp
#include <ESP8266WiFi.h>      // 本程序使用 ESP8266WiFi库
#include <ESP8266WiFiMulti.h> //  ESP8266WiFiMulti库
#include <ESP8266WebServer.h> //  ESP8266WebServer库
#include <main.h>

// 这里是一个简单的网络服务器示例程序，用于演示如何通过网络服务将开发板引脚状态显示在网页中。
// 需要注意的是,当用户访问NodeMCU的IP地址时，将会看到一个显示按键状态的网页,但是这个网页不会自动刷新。
// 为了查看按键状态的变化，用户需要手动刷新网页。

#define buttonPin D3 // 按钮引脚D3

ESP8266WiFiMulti wifiMulti; // 建立ESP8266WiFiMulti对象,对象名称是'wifiMulti'

ESP8266WebServer esp8266_server(80); // 建立网络服务器对象，该对象用于响应HTTP请求。监听端口（80）

bool pinState; // 存储引脚状态用变量

void setup()
{
    Serial.begin(9600); // 启动串口通讯

    pinMode(buttonPin, INPUT_PULLUP); // 将按键引脚设置为输入上拉模式

    wifiMulti.addAP("C++", "309309309");                         // 将需要连接的一系列WiFi ID和密码输入这里
    wifiMulti.addAP("ssid_from_AP_2", "your_password_for_AP_2"); // ESP8266-NodeMCU再启动后会扫描当前网络
    wifiMulti.addAP("ssid_from_AP_3", "your_password_for_AP_3"); // 环境查找是否有这里列出的WiFi ID。如果有
    Serial.println("Connecting ...");                            // 则尝试使用此处存储的密码进行连接。

    int i = 0;
    while (wifiMulti.run() != WL_CONNECTED)
    {                // 此处的wifiMulti.run()是重点。通过wifiMulti.run()，NodeMCU将会在当前
        delay(1000); // 环境中搜索addAP函数所存储的WiFi。如果搜到多个存储的WiFi那么NodeMCU
        Serial.print(i++);
        Serial.print(' '); // 将会连接信号最强的那一个WiFi信号。
    } // 一旦连接WiFI成功，wifiMulti.run()将会返回“WL_CONNECTED”。这也是
      // 此处while循环判断是否跳出循环的条件。
    // WiFi连接成功后将通过串口监视器输出连接成功信息
    Serial.println('\n');           // WiFi连接成功后
    Serial.print("Connected to ");  // NodeMCU将通过串口监视器输出。
    Serial.println(WiFi.SSID());    // 连接的WiFI名称
    Serial.print("IP address:\t");  // 以及
    Serial.println(WiFi.localIP()); // NodeMCU的IP地址

    esp8266_server.begin();                    // 启动网站服务
    esp8266_server.on("/", handleRoot);        // 设置服务器根目录即'/'的函数'handleRoot'
    esp8266_server.onNotFound(handleNotFound); // 设置处理404情况的函数'handleNotFound'

    Serial.println("HTTP esp8266_server started"); //  告知用户ESP8266网络服务功能已经启动
}

void loop()
{
    esp8266_server.handleClient();     // 处理http服务器访问
    pinState = digitalRead(buttonPin); // 获取引脚状态
}

/* 以下函数处理网站首页的访问请求。此函数为本示例程序重点1
详细讲解请参见太极创客网站《零基础入门学用物联网》
第3章-第2节“通过网络服务将开发板引脚状态显示在网页中”的说明讲解。*/
void handleRoot()
{
    String displayPinState; // 存储按键状态的字符串变量

    if (pinState == HIGH)
    {                                           // 当按键引脚D3为高电平
        displayPinState = "Button State: HIGH"; // 字符串赋值高电平信息
    }
    else
    {                                          // 当按键引脚D3为低电平
        displayPinState = "Button State: LOW"; // 字符串赋值低电平信息
    }

    esp8266_server.send(200, "text/plain", displayPinState);
    // 向浏览器发送按键状态信息
}

// 设置处理404情况的函数'handleNotFound'
void handleNotFound()
{                                                             // 当浏览器请求的网络资源无法在服务器找到时，
    esp8266_server.send(404, "text/plain", "404: Not found"); // NodeMCU将调用此函数。
}